Revit 2027 API
IndependentTag.HasTagText Method
 Checks if the IndependentTag has a valid tag text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasTagText()
Public Function HasTagText As Boolean
public:
bool HasTagText()
member HasTagText : unit -> bool
Return Value
Boolean
 True if the IndependentTag object has a valid tag text.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace